app/controllers/on_taraf/anasayfa_controller.rb

  def index
      @paylasimlar = Paylasim.all
---
SELECT "paylasims".* FROM "paylasims"