app/controllers/on_taraf/paylasimdetay_controller.rb

SELECT  "paylasims".* FROM "paylasims" WHERE "paylasims"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def index
       if params[:id]
         @paylasim = Paylasim.find(params[:id])