app/controllers/paylasims_controller.rb

SELECT "paylasims".* FROM "paylasims"
---
  def index
    @paylasims = Paylasim.all

INSERT INTO "paylasims" ("baslik", "icerik", "created_at", "updated_at", "resim_file_name", "resim_content_type", "resim_file_size", "resim_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @paylasim = Paylasim.new(paylasim_params)

    respond_to do |format|
      if @paylasim.save

DELETE FROM "paylasims" WHERE "paylasims"."id" = ?  [["id", 1]]
---
  def destroy
    @paylasim.destroy

SELECT  "paylasims".* FROM "paylasims" WHERE "paylasims"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_paylasim
      @paylasim = Paylasim.find(params[:id])